Repository: algorithm-ninja/terry
Catalog: frontend/src/locales/*/messages.po
Languages: it

source: (in minutes)
it: (in minuti)

source: {0, plural, =0 {No extra time set} one {Contest duration was extended by # minute} other {Contest duration was extended by # minutes}}
it: {0, plural, =0 {La gara non è stata estesa} one {La gara è stata estesa di # minuto} other {La gara è stata estesa di # minuti}}

source: {0, plural, =0 {No user has extra time} one {# user has extra time} other {# users have extra time}}
it: {0, plural, =0 {Nessuno studente ha tempo aggiuntivo} one {# studente ha tempo aggiuntivo} other {# studenti hanno tempo aggiuntivo}}

source: {0, plural, one {plus # extra minute for some user} other {plus # extra minutes for some user}}
it: {0, plural, one {più # minuto aggiuntivi per alcuni studenti} other {più # minuti aggiuntivi per alcuni studenti}}

source: <0>Be careful!</0>Once the contest starts it cannot be stopped!
it: <0>Attenzione!</0> Una volta che la gara inizia non è più possibile fermarla!

source: Abandon this expired input
it: Abbandona questo input scaduto

source: Abandon this input now
it: Abbandona questo input ora

source: Admin communication token
it: Token di admin per la comunicazione

source: Announcements
it: Annunci

source: Answer
it: Rispondi

source: Answer with Markdown
it: Rispondi con Markdown

source: Answered
it: Con risposta

source: Are you sure?
it: Sei sicuro?

source: Ask a question
it: Fai una domanda

source: Automatic start disabled
it: Avvio automatico disabilitato

source: Automatic start updated
it: Avvio automatico impostato

source: Cancel
it: Annulla

source: Cannot reach the communication server, your browser will try again automatically. The info shown are just a local copy that may be outdated.
it: Impossibile raggiungere il server delle comunicazioni, il tuo browser riproverà a connettersi automaticamente. Le informazioni visualizzate sono una copia locale che potrebbe non essere aggiornata.

source: Cannot submit for this input.
it: Impossibile sottomettere per questo input.

source: Category
it: Categoria

source: Category filter
it: Filtra categoria

source: Change output
it: Modifica output

source: Change source
it: Modifica sorgente

source: Clear
it: Annulla

source: Close
it: Chiudi

source: CodeBlocks project
it: Progetto CodeBlocks

source: Communication
it: Comunicazioni

source: Communication system
it: Sistema di comunicazione

source: Compiled binary
it: Binario compilato

source: Compiled file
it: File compilato

source: Compiled Java binary
it: Binario Java compilato

source: Compiled Java class
it: Classe Java compilata

source: Compiled Python object
it: Oggetto Python compilato

source: Compressed archive
it: Archivio compresso

source: Content
it: Contenuto

source: Contest ended at
it: La gara è finita il

source: Contest ended for everyone at
it: La gara è finita per tutti il

source: Contest started at
it: La gara è iniziata il

source: Contest started successfully
it: Gara avviata con successo

source: Contest status
it: Stato della gara

source: Contestants
it: Partecipanti

source: correct
it: corretto

source: Creating final zip...
it: Creazione zip finale...

source: Danger (red)
it: Danger (rosso)

source: Danger zone
it: Zona pericolosa

source: Dark (grey)
it: Dark (grigio)

source: Date
it: Data

source: Details
it: Dettagli

source: Detected language:
it: Linguaggio rilevato:

source: Dev-Cpp project
it: Progetto di Dev-Cpp

source: Download contest results
it: Scarica i risultati della gara

source: Download input
it: Scarica input

source: Download results
it: Scarica risultati

source: Error
it: Errore

source: Excel document
it: Documento Excel

source: Extra material
it: Materiale extra

source: Extra time
it: Tempo aggiuntivo

source: Extra time successfully updated
it: Tempo aggiuntivo modificato con successo

source: Extra time successfully updated for the user
it: Tempo aggiuntivo dello studente modificato con successo

source: Free Pascal Lazarus file
it: File di Free Pascal Lazarus

source: Free Pascal Lazarus project
it: Progetto di Free Pascal Lazarus

source: Free Pascal Lazarus session file
it: File di sessione di Free Pascal Lazarus

source: Image
it: Immagine

source: Info (teal)
it: Info (azzurro)

source: Input file
it: File di input

source: Issue last detected
it: Ultimo errore rilevato

source: Last submission:
it: Ultima sottoposizione:

source: Last update:
it: Ultima modifica:

source: Level
it: Livello

source: Loading...
it: Caricamento...

source: Log in
it: Accedi

source: Login
it: Accedi

source: Message
it: Messaggio

source: Message filter
it: Filtra messaggio

source: Name
it: Nome

source: Network problem. Reconnecting...
it: Problema di rete. Riconnessione in corso...

source: New announcement
it: Nuovo annuncio

source: New announcement: {0}
it: Nuovo annuncio: {0}

source: No announcements yet.
it: Ancora nessun annuncio.

source: No issue detected
it: Nessun problema rilevato

source: No messages yet
it: Ancora nessun messaggio

source: No new questions
it: Nessuna nuova domanda

source: No questions
it: Nessuna domanda

source: Not answered
it: Senza risposta

source: Not answered yet.
it: Ancora senza risposta.

source: On the left side of this page you can find the tasks, click on any one to open it.
it: Nella parte sinistra di questa pagina trovi la lista dei problemi, premi sul nome di un problema per aprirlo.

source: OpenDocument document
it: Documento OpenDocument

source: Output file
it: File di output

source: Output file info
it: Info sull'output

source: Output file...
it: File di output...

source: Pages document
it: Documento Pages

source: PDF file
it: File PDF

source: Please login
it: Esegui l'accesso

source: Please select the contest file...
it: Seleziona il pacchetto di gara...

source: Preview
it: Anteprima

source: Primary (blue)
it: Primary (blu)

source: Processing...
it: Caricamento...

source: Pseudocode
it: Pseudocodice

source: Publish
it: Pubblica

source: Question answered!
it: Nuova risposta!

source: Questions
it: Domande

source: Questions and Announcements
it: Domande e annunci

source: Remaining time
it: Tempo rimanente

source: Remaining time for some participant
it: Tempo rimanente per alcuni partecipanti

source: Request input
it: Richiedi input

source: Request new input
it: Richiedi nuovo input

source: Requesting...
it: Generazione...

source: Scheduled start at<0/>. This page will reload automatically.
it: Inizio previsto alle <0/>. Questa pagina si ricaricherà automaticamente.

source: Score
it: Punteggio

source: Secondary (grey)
it: Secondary (grigio)

source: Select a file with an extension
it: Seleziona un file con un'estensione

source: Send
it: Invia

source: Set
it: Imposta

source: set extra time
it: imposta tempo aggiuntivo

source: Set extra time
it: Imposta tempo aggiuntivo

source: Severity
it: Severità

source: show log
it: mostra log

source: show users
it: mostra utenti

source: Showing only the questions of<0>{filter}</0>
it: Visualizzate solo le domande di <0>{filter}</0>

source: Size:
it: Dimensione

source: Source file
it: Sorgente

source: Source file info
it: Informazioni sorgente

source: Source file...
it: Sorgente...

source: Start
it: Avvia

source: Start automatically the contest
it: Avvia automaticamente la gara

source: Start the contest immediately
it: Avvia la gara adesso

source: Submission
it: Sottoposizione

source: Submission for
it: Sottoposizione per

source: Submission for input
it: Sottoposizione per l'input

source: Submit
it: Invia

source: Success (green)
it: Success (verde)

source: Surname
it: Cognome

source: System status
it: Stato del sistema

source: Task not found
it: Problema non trovato

source: Tasks
it: Problemi

source: Text file
it: File di testo

source: The answer to one of your questions got updated
it: La risposta ad una tua domanda è stata aggiornata

source: The communication system is enabled for this contest.
it: Il sistema di comunicazione è attivo per questa gara.

source: The communication system is not available for this contest.
it: Il sistema di comunicazione non è disponibile per questa gara.

source: The contest has not started yet!
it: La gara non è ancora iniziata!

source: The contest has not started yet! Refresh this page when the contest has started to be able to login.
it: La gara non è ancora iniziata! Per connetterti ricarica questa pagina quando la gara sarà iniziata.

source: The contest is finished
it: La gara è terminata

source: The contest is finished, you must now download the zip containing all the contest data. This zip must then be sent to the committee.
it: La gara è terminata, devi adesso scaricare l'archivio zip contenente tutti i dati della gara. Questo zip dovrà essere poi spedito al comitato.

source: The contest will start automatically at
it: La gara inizierà automaticamente alle

source: The contest would start
it: La gara inizierebbe

source: The extension cannot contain spaces
it: L'estensione del file non deve contenere spazi

source: The file you selected has been detected as an executable. Please select the corresponding source file instead.
it: Il file che hai selezionato sembra essere un eseguibile. Seleziona il corrispondente file sorgente.

source: The file you selected is not allowed, please select the actual source file of your program. The detected file type is
it: Il file che hai selezionato non è consentito, seleziona il sorgente del tuo programma. Il tipo di file rilevato è:

source: The file you selected is too big ({size} bytes > {MAX_SOURCE_SIZE} bytes)
it: Il file che hai selezionato è troppo grande ({size} bytes > {MAX_SOURCE_SIZE} bytes)

source: The provided date cannot be used as start time for the contest. Please set a date in the future.
it: La data inserita non può essere usata come data di inizio della gara. Inserisci una data nel futuro.

source: The question must be at least {MIN_QUESTION_LENGTH} characters long.
it: La domanda deve essere lunga almeno {MIN_QUESTION_LENGTH} caratteri.

source: The question will be sent to the staff, who will analyze it and try to answer as quickly as possible. You will receive a notification (if you enabled them) when the answer is available. Please be patient if the answer lags to arrive, and try to be respectful.<0/>You can ask for clarifications about the tasks, but the staff takes the authority to decide whether to answer or not.
it: La tua domanda verrà inviata allo staff che la analizzerà e cercherà di rispondere più velocemente possibile. Riceverai una notifica (se le hai abilitate) quando la risposta sarà disponibile. Cerca di essere paziente se la risposta ritarda ad arrivare, e cerca di mantenere un tono rispettoso.<0/>Puoi chiedere chiarimenti sui problemi, ma lo staff si riserva l'autorità di decidere a cosa rispondere.

source: This input has expired.
it: Questo input è scaduto.

source: This input will expire:
it: Questo input scadrà:

source: Title
it: Titolo

source: to the scheduled start
it: all'inizio della gara

source: Updated announcement: {0}
it: Annuncio aggiornato: {0}

source: Upload
it: Carica

source: Upload solution
it: Carica soluzione

source: Usage guide
it: Guida

source: view all submissions
it: tutte le sottoposizioni

source: view details
it: dettagli

source: Visit
it: Visita

source: Visual Studio project
it: Progetto di Visual Studio

source: Warning (yellow)
it: Warning (giallo)

source: Word document
it: Documento Word

source: wrong
it: errato

source: XML file
it: File XML

source: You can set an extra time for all the contestants in case of problems that afflicts everyone. This action<0>is logged</0>and must be justified to the committee.
it: Puoi impostare del tempo aggiuntivo per tutti i partecipanti in caso di problemi tecnici che hanno colpito tutti. Questa azione <0>viene registrata</0> e va giustificata al comitato.

source: You can submit<0>as many times as you want</0>, but you will have a different input every time. When you make a submission remember to send the correct source file and the output corresponding to the last generated input. When you have uploaded your files<1>remember to submit</1>them by clicking the green button!
it: Puoi inviare <0>quante sottoposizioni vuoi</0>, ma riceverai file di input ogni volta diversi. Quando fai una sottoposizione ricorda di inviare il file sorgente corretto e il file di output relativo all'ultimo input generato. Quando carichi i due file <1>ricorda di inviarli</1> premendo il pulsante verde!

source: You have not submitted yet.
it: Non hai ancora sottomesso nulla.

source: You have to be logged in to ask a question.
it: Devi effettuare l'accesso per poter fare domande.

source: You selected a file with an unknown extension. This submission may be invalidated if this file is not the true source of the program that generated the output file. If you think you selected the wrong file, please change it before submitting.
it: Hai selezionato un file con un'estensione sconosciuta. Questa sottoposizione potrebbe essere invalidata se non si tratta del vero sorgente del programma che ha generato il file di output. Se pensi di aver selezionato il file sbagliato cambialo prima di inviare la sottoposizione.

source: You selected an empty file
it: Hai selezionato un file vuoto

source: Your score
it: Punteggio
